Revit 2026 API

# AnalyticalSupportType Enumeration

---

Indicates what kind of support another Element provides -- Point, Surface, or Curve.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalSupportType
```
```vb
Public Enumeration AnalyticalSupportType
```
```cpp
public enum class AnalyticalSupportType
```
```fsharp
type AnalyticalSupportType
```

| Member name | Value | Description |
| --- | --- | --- |
| CurveSupport | 2 | Support along a curve. |
| PointSupport | 1 | Support at just one point. |
| SurfaceSupport | 3 | Support along a surface. |
| UnknownSupport | 0 | Support has not been determined. |

#### Reference

Autodesk.Revit.DB.Structure Namespace